from hw_config.hw_config_model import ComponentCategory

dummy_data = {
	ComponentCategory.SYSTEM_UNIT: [
		"Системный блок в защищенном исполнении «Манул», НИКА.466533.412",
		"Системный блок БЕШТАУ PC1167/B560-01, БЕРТ.466219.003-001",
		"Системный блок БЕШТАУ PC1167/Q670-01, БЕРТ.466219.003-003",
		"Системный блок БЕШТАУ PC1124/J4125-01, БЕРТ.466219.003-005",
		"Системный блок БЕШТАУ PC1124/B250-01, БЕРТ.466219.003-004",
		"Системный блок БЕШТАУ PC1167/H610-01, БЕРТ.466219.003-002",
		"Системный блок RDW Extreme GA",
		"Системный блок RDW Optimal GD",
		"Системный блок RDW Extreme GB",
		"Системный блок RDW Optimal GB",
		"Системный блок RDW Personal GA",
	],
	ComponentCategory.MONITOR: [
		"Монитор БЕШТАУ M24FHD",
		"LCD-монитор «Сова» модель OМ238I, арт. OМ238I.FHD.SS.01.P2, ВРТГ.463135.116 ",
		"LCD-монитор «Сова» модель OМ270I, арт. OМ270I.QHD.AS.01.P2, ВРТГ.463135.116-07 ",
		"LCD-монитор «Сова» модель OМ270I, арт. OМ270I.QHD.SS.01.P2, ВРТГ.463135.116-06",
		"LCD-монитор «Сова» модель OМ238I, арт. OМ238I.FHD.AS.01.P2, ВРТГ.463135.116-01",
		"LCD-монитор «Сова» модель OМ238I, арт. OМ238I.QHD.SS.01.P3, ВРТГ.463135.116-02",
		"LCD-монитор «Сова» модель OМ270I, арт. OМ270I.FHD.SS.01.P2, ВРТГ.463135.116-04",
		"LCD-монитор «Сова» модель ОМ315I, арт. ОМ315I.QHD.AS.04.P3, ВРТГ.463135.116-11",
		"LCD-монитор «Сова» модель OМ270I, арт. OМ270I.QHD.SS.03.P3, ВРТГ.463135.116-08",
		"Монитор с жидкокристаллическим экраном торговой марки IRBIS модели SmartView24",
	],
	ComponentCategory.KEYBOARD: [
		"Клавиатура ППКОП-16 NFC в корпусе М4",
		"Клавиатура ППКОП-16 в корпусе М4",
		"Клавиатура ППКОП NFC в корпусе М4",
		"Клавиатура ППКОП NFC (8)",
		"Клавиатура «Протон КС-4/8»",
		"Клавиатура «Протон КС-20»",
		"Клавиатура БЕШТАУ КЛ104РУ",
	],
	ComponentCategory.MOUSE: [
		"Мышь компьютерная БЕШТАУ М100РУ",
	],
}
